---
kind: type
id: T:Autodesk.Revit.DB.ModelCurveArrArrayIterator
source: html/d4814afc-1580-c846-d69e-c1a02a211bcd.htm
---
# Autodesk.Revit.DB.ModelCurveArrArrayIterator

An iterator to a array.

## Syntax (C#)
```csharp
public abstract class ModelCurveArrArrayIterator : APIObject,
	IEnumerator
```